package weathergo

// 都道府県を表す値
type PrefectureCode int

// 県庁所在地の情報を表す構造体
type Location struct {
	Prefecture string  // 都道府県名
	City       string  // 都市名
	Latitude   float64 // 緯度
	Longitude  float64 // 経度
}

const DefaultPref = 13

// 47都道府県の県庁所在地データ
var prefecturalCapitals = map[PrefectureCode]Location{
	1:  {"北海道", "札幌市", 43.0641, 141.3469},
	2:  {"青森県", "青森市", 40.8244, 140.7400},
	3:  {"岩手県", "盛岡市", 39.7036, 141.1525},
	4:  {"宮城県", "仙台市", 38.2682, 140.8694},
	5:  {"秋田県", "秋田市", 39.7186, 140.1023},
	6:  {"山形県", "山形市", 38.2554, 140.3396},
	7:  {"福島県", "福島市", 37.7503, 140.4675},
	8:  {"茨城県", "水戸市", 36.3659, 140.4711},
	9:  {"栃木県", "宇都宮市", 36.5658, 139.8835},
	10: {"群馬県", "前橋市", 36.3895, 139.0634},
	11: {"埼玉県", "さいたま市", 35.8616, 139.6455},
	12: {"千葉県", "千葉市", 35.6073, 140.1233},
	13: {"東京都", "新宿区", 35.6895, 139.6917},
	14: {"神奈川県", "横浜市", 35.4478, 139.6425},
	15: {"新潟県", "新潟市", 37.9162, 139.0364},
	16: {"富山県", "富山市", 36.6953, 137.2113},
	17: {"石川県", "金沢市", 36.5613, 136.6562},
	18: {"福井県", "福井市", 36.0641, 136.2196},
	19: {"山梨県", "甲府市", 35.6621, 138.5683},
	20: {"長野県", "長野市", 36.6485, 138.1942},
	21: {"岐阜県", "岐阜市", 35.4233, 136.7606},
	22: {"静岡県", "静岡市", 34.9756, 138.3831},
	23: {"愛知県", "名古屋市", 35.1814, 136.9064},
	24: {"三重県", "津市", 34.7186, 136.5053},
	25: {"滋賀県", "大津市", 35.0178, 135.8547},
	26: {"京都府", "京都市", 35.0117, 135.7681},
	27: {"大阪府", "大阪市", 34.6937, 135.5023},
	28: {"兵庫県", "神戸市", 34.6913, 135.1830},
	29: {"奈良県", "奈良市", 34.6851, 135.8048},
	30: {"和歌山県", "和歌山市", 34.2305, 135.1708},
	31: {"鳥取県", "鳥取市", 35.5036, 134.2383},
	32: {"島根県", "松江市", 35.4681, 133.0484},
	33: {"岡山県", "岡山市", 34.6618, 133.9344},
	34: {"広島県", "広島市", 34.3852, 132.4553},
	35: {"山口県", "山口市", 34.1785, 131.4737},
	36: {"徳島県", "徳島市", 34.0703, 134.5548},
	37: {"香川県", "高松市", 34.3428, 134.0466},
	38: {"愛媛県", "松山市", 33.8392, 132.7656},
	39: {"高知県", "高知市", 33.5597, 133.5311},
	40: {"福岡県", "福岡市", 33.5904, 130.4017},
	41: {"佐賀県", "佐賀市", 33.2635, 130.3009},
	42: {"長崎県", "長崎市", 32.7501, 129.8777},
	43: {"熊本県", "熊本市", 32.7898, 130.7417},
	44: {"大分県", "大分市", 33.2382, 131.6126},
	45: {"宮崎県", "宮崎市", 31.9077, 131.4202},
	46: {"鹿児島県", "鹿児島市", 31.5601, 130.5579},
	47: {"沖縄県", "那覇市", 26.2124, 127.6809},
}

// 都道府県コードから Location を取得
func GetPrefCapitalData(code int) (*Location, bool) {
	if name, ok := prefecturalCapitals[PrefectureCode(code)]; ok {
		return &name, true
	}
	return nil, false
}
